<a href="https://colab.research.google.com/github/dayan2222/Pandas-PIAIC/blob/master/Data_Read_and_Write.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Loding Data in CSV

In [0]:
import pandas as pd

In [0]:
sample_pdf = pd.read_csv("/content/sample_data/potions.csv")

In [0]:
sample_pdf

                     Potion             Effect    Telltale Property
0                Amortentia               Love                Steam
1      Confusing Concoction          Confusion               Nausea
2   Draught of Living Death              Sleep  Turns leaf to ashes
3          Draught of Peace            Comfort                 None
4             Felix Felicis               Luck            Giddiness
5        Hiccoughing Potion    Stops hiccoughs                 None
6           Pepperup Potion             Health        Steaming Ears
7          Polyjuice Potion     Shape shifting         Voice change
8                 Skele-Gro        Bone growth     Disgusting taste
9   Sleekeazy's Hair Potion  Hair straightener                 None
10              Veritaserum      Truth-telling                 None

In [0]:
sample_pdf = pd.read_csv('/content/sample_data/potions.csv',skiprows=1, names = ['Pos', 'Eff', 'TP'])

In [0]:
sample_pdf

                        Pos                Eff                   TP
0                Amortentia               Love                Steam
1      Confusing Concoction          Confusion               Nausea
2   Draught of Living Death              Sleep  Turns leaf to ashes
3          Draught of Peace            Comfort                 None
4             Felix Felicis               Luck            Giddiness
5        Hiccoughing Potion    Stops hiccoughs                 None
6           Pepperup Potion             Health        Steaming Ears
7          Polyjuice Potion     Shape shifting         Voice change
8                 Skele-Gro        Bone growth     Disgusting taste
9   Sleekeazy's Hair Potion  Hair straightener                 None
10              Veritaserum      Truth-telling                 None

**Hierarichal Index**

In [0]:
load = pd.read_csv("/content/sample_data/potions.csv")
load 
load = pd.read_csv("/content/sample_data/potions.csv", index_col=['Effect', 'Telltale Property'])
load

                                                        Potion
Effect            Telltale Property
Love              Steam                             Amortentia
Confusion         Nausea                  Confusing Concoction
Sleep             Turns leaf to ashes  Draught of Living Death
Comfort           None                        Draught of Peace
Luck              Giddiness                      Felix Felicis
Stops hiccoughs   None                      Hiccoughing Potion
Health            Steaming Ears                Pepperup Potion
Shape shifting    Voice change                Polyjuice Potion
Bone growth       Disgusting taste                   Skele-Gro
Hair straightener None                 Sleekeazy's Hair Potion
Truth-telling     None                             Veritaserum

<h1>Missing Values</h1>

In [0]:
load_missing = pd.read_csv ("/content/sample_data/something.csv")
print(load_missing)

# changing data while loading in dataframe
# dictionary = column name: [source values, target values]
sentinels = {'message': ['foo', 'NA']} 
load_missing = pd.read_csv("/content/sample_data/something.csv", na_values=sentinels)
load_missing

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

<h1>Reading and Text Files in Pieces </h1>
<P>Calling specific number of rows in huge datasets</p>

In [0]:
# extracted selected rows from a large datasets
pd.read_csv("/content/sample_data/train.csv", nrows = 100)

    battery_power  blue  clock_speed  ...  touch_screen  wifi  price_range
0             842     0          2.2  ...             0     1            1
1            1021     1          0.5  ...             1     0            2
2             563     1          0.5  ...             1     0            2
3             615     1          2.5  ...             0     0            2
4            1821     1          1.2  ...             1     0            1
..            ...   ...          ...  ...           ...   ...          ...
95           1137     1          1.0  ...             1     1            3
96           1355     0          2.3  ...             1     0            0
97           1665     1          0.5  ...             0     0            2
98            657     0          2.5  ...             1     0            0
99            593     0          0.5  ...             0     0            1

[100 rows x 21 columns]

In [0]:
# to read a file in pieces, specify a chunksize as a number of rows:
chunks = pd.read_csv("/content/sample_data/train.csv", chunksize=200)

chunkList = []
for chunk in chunks:
  # each chunk will work as dataframe 
  #print(type(chunk), len(chunk))
  #print(chunk.head())
  chunkList.append(chunk)
df = chunkList[0]
df.head()

   battery_power  blue  clock_speed  ...  touch_screen  wifi  price_range
0            842     0          2.2  ...             0     1            1
1           1021     1          0.5  ...             1     0            2
2            563     1          0.5  ...             1     0            2
3            615     1          2.5  ...             0     0            2
4           1821     1          1.2  ...             1     0            1

[5 rows x 21 columns]

<h1>Reading from Multispace</h1>

In [0]:
list(open("/content/sample_data/ex3.txt"))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [0]:
# use spaces (one or more) as a delimiter 
result = pd.read_table("/content/sample_data/ex3.txt", sep='\s+')
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [0]:
df = pd.read_csv("/content/sample_data/ex4.csv")
df

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [0]:
# skip rows
df = pd.read_csv("/content/sample_data/ex4.csv",skiprows=[0,2,3])
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

# Writing Data to text Format

In [0]:
data = pd.read_csv("/content/sample_data/ex5.csv")
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [0]:
data.to_csv("/content/sample_data/out.csv")

In [0]:
import numpy as np
dates = pd.date_range('1/1/2000', periods=7)
ts = pd.Series(np.arange(7), index=dates, name='Table')
ts.to_csv("/content/sample_data/date.csv")

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:4: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  after removing the cwd from sys.path.

{Timestamp('2000-01-01 00:00:00', freq='D'): 0,
 Timestamp('2000-01-02 00:00:00', freq='D'): 1,
 Timestamp('2000-01-03 00:00:00', freq='D'): 2,
 Timestamp('2000-01-04 00:00:00', freq='D'): 3,
 Timestamp('2000-01-05 00:00:00', freq='D'): 4,
 Timestamp('2000-01-06 00:00:00', freq='D'): 5,
 Timestamp('2000-01-07 00:00:00', freq='D'): 6}

In [0]:
table = pd.read_csv("/content/sample_data/date.csv")
table

   2000-01-01  0
0  2000-01-02  1
1  2000-01-03  2
2  2000-01-04  3
3  2000-01-05  4
4  2000-01-06  5
5  2000-01-07  6

Working With Delimited Formats

In [0]:
import csv
f = open('/content/sample_data/ex7.csv')
reader = csv.reader(f)
for line in reader:
  print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

# JSON DATA
Short form of JavaScript Object Notation

In [0]:
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
{"name": "Katie", "age": 38,
"pets": ["Sixes", "Stache", "Cisco"]}]
}
"""
print(obj)

{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
{"name": "Katie", "age": 38,
"pets": ["Sixes", "Stache", "Cisco"]}]
}

In [0]:
# Same Like Dictionary
data = pd.read_json('/content/sample_data/example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

# XML and HTML: Web data loading in to dataframe

In [0]:
#conda install lxml
# conda install -c anaconda beautifulsoup4 
# htconda install -c anaconda html5lib
tables = pd.read_html('/content/sample_data/fdic_failed_bank_list.html')
# tables variable type is not dataframe, its list
print(type(tables))
print(len(tables))

<class 'list'>
1

In [0]:
failures_df = tables[0]
failures_df

                             Bank Name  ...       Updated Date
0                          Allied Bank  ...  November 17, 2016
1         The Woodbury Banking Company  ...  November 17, 2016
2               First CornerStone Bank  ...  September 6, 2016
3                   Trust Company Bank  ...  September 6, 2016
4           North Milwaukee State Bank  ...      June 16, 2016
..                                 ...  ...                ...
542                 Superior Bank, FSB  ...    August 19, 2014
543                Malta National Bank  ...  November 18, 2002
544    First Alliance Bank & Trust Co.  ...  February 18, 2003
545  National State Bank of Metropolis  ...     March 17, 2005
546                   Bank of Honolulu  ...     March 17, 2005

[547 rows x 7 columns]

In [0]:
print(type(failures_df))
print(len(failures_df))
print(failures_df.shape)

<class 'pandas.core.frame.DataFrame'>
547
(547, 7)

In [0]:
# warning: data is bit lengthy in this data frame
print(failures_df.columns)
len(failures_df)

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'],
      dtype='object')

547

In [0]:
print(failures_df["City"].head())
print(failures_df["Bank Name"].head())
print(failures_df.head())

0           Mulberry
1           Woodbury
2    King of Prussia
3            Memphis
4          Milwaukee
Name: City, dtype: object
0                     Allied Bank
1    The Woodbury Banking Company
2          First CornerStone Bank
3              Trust Company Bank
4      North Milwaukee State Bank
Name: Bank Name, dtype: object
                      Bank Name  ...       Updated Date
0                   Allied Bank  ...  November 17, 2016
1  The Woodbury Banking Company  ...  November 17, 2016
2        First CornerStone Bank  ...  September 6, 2016
3            Trust Company Bank  ...  September 6, 2016
4    North Milwaukee State Bank  ...      June 16, 2016

[5 rows x 7 columns]

In [0]:
# for large and complicated dataframe, try to extract
# data as series for review and analysis
# here we converted a column into a new series of date type
close_timestamps = pd.to_datetime(failures_df['Closing Date'])
print(type(close_timestamps),close_timestamps)

<class 'pandas.core.series.Series'> 0     2016-09-23
1     2016-08-19
2     2016-05-06
3     2016-04-29
4     2016-03-11
         ...
542   2001-07-27
543   2001-05-03
544   2001-02-02
545   2000-12-14
546   2000-10-13
Name: Closing Date, Length: 547, dtype: datetime64[ns]

In [0]:
print(len(close_timestamps))

547

In [0]:
import csv
f = open('/content/sample_data/ex7.csv')
reader = csv.reader(f)
for line in reader:
  print(line)

# Binary Data Format

In [0]:
frame = pd.read_csv('examples/ex1.csv')
frame.to_pickle('examples/frame_pickle')
pd.read_pickle('examples/frame_pickle')

In [0]:
# Using HDF5 Format
import numpy as np
import pandas as pd
frame = pd.DataFrame({'a': np.random.randn(100)})
store = pd.HDFStore('mydata.h5')
store['obj1'] = frame
store['obj1_col'] = frame['a']
print(store)
x=store.obj1
print(type(x))
print(x.head())
print('--------------')
store.put('obj2', frame, format='table')
store.select('obj2', where=['index >= 10 and index <= 15'])
store.close()
frame.to_hdf('mydata.h5', 'obj3', format='table')
frame = pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

<class 'pandas.core.frame.DataFrame'>
          a
0 -1.420393
1  0.273322
2  0.832833
3  2.156957
4 -0.014517
--------------

# Reading Microsoft Excel Files

In [0]:
#reading
import pandas as pd

xlsx = pd.ExcelFile('/content/sample_data/ex1.xlsx')
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [0]:
frame = pd.read_excel('/content/sample_data/ex1.xlsx', 'Sheet1')
# writing
writer = pd.ExcelWriter('/content/sample_data/ex2.xlsx')
frame.to_excel(writer, 'Sheet1')
writer.save()
# alternative option for single sheet
frame.to_excel('/content/sample_data/ex2.xlsx')
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

# Interacting with Web APIs

In [0]:
import requests
import numpy as np

In [0]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues' # loading the url

In [0]:
resp = requests.get(url) # saves the response
data = resp.json()
print(type(data))
#print(data)

<class 'list'>

In [0]:
data_dict = data[0]
#print(data_dict['title'])
print(data_dict.keys()) # print all the keys 
issues = pd.DataFrame(data, columns=['url','events_url','id']) 
issues.head()

# Loading Data From PSX 100 Index

In [0]:
#ctl00_ctl42_g_7f68baae_5353_4bdd_bfe1_b88e3367234f_csr1_table
# extract tables from wikipedia
from pandas.io.html import read_html
page = 'https://en.wikipedia.org/wiki/List_of_Asian_countries_by_area'

wikitables = read_html(page,  attrs={"class":"wikitable"})

print ("Extracted {num} wikitables".format(num=len(wikitables)))

Extracted 1 wikitables

In [0]:
wikitables[0]

    Rank  ...                                              Notes
0    1.0  ...              17,098,242 including European part[1]
1    2.0  ...  excludes Hong Kong, Macau, Taiwan and disputed...
2    3.0  ...             including Jammu and Kashmir and Ladakh
3    4.0  ...                                                NaN
4    5.0  ...                                                NaN
5    6.0  ...                                                NaN
6    7.0  ...                                                NaN
7    8.0  ...              1,904,569 km² including Oceanian part
8    9.0  ...                                                NaN
9   10.0  ...                                                NaN
10  11.0  ...                                                NaN
11  12.0  ...                                                NaN
12  13.0  ...                                                NaN
13  14.0  ...                                                NaN
14  15.0  ...                                                NaN
15  16.0  ...                                                NaN
16  17.0  ...                                                NaN
17  18.0  ...                                                NaN
18  19.0  ...                                                NaN
19  20.0  ...                                                NaN
20  21.0  ...                                                NaN
21  22.0  ...                                                NaN
22  23.0  ...                                                NaN
23  24.0  ...                                                NaN
24  25.0  ...            Includes the parts of the Golan Heights
25  26.0  ...                                                NaN
26  27.0  ...                                                NaN
27  28.0  ...                                                NaN
28  29.0  ...                                                NaN
29  30.0  ...                                                NaN
30  31.0  ...                                                NaN
31  32.0  ...                                                NaN
32  33.0  ...                                                NaN
33  34.0  ...                                                NaN
34  35.0  ...                                                NaN
35  36.0  ...                                                NaN
36  37.0  ...               1,002,450 km² including African part
37  38.0  ...                                                NaN
38  39.0  ...         partially recognized state/not a UN member
39  40.0  ...                                                NaN
40  41.0  ...                                                NaN
41  42.0  ...                                                NaN
42  43.0  ...                                                NaN
43  44.0  ...                Sometimes considered part of Europe
44  45.0  ...                Sometimes considered part of Europe
45  46.0  ...  partially recognized state/non-member observer...
46  47.0  ...                                                NaN
47  48.0  ...                                                NaN
48  49.0  ...                                                NaN
49  50.0  ...                                                NaN
50   NaN  ...                                                NaN

[51 rows x 4 columns]

In [0]:
wikitables[0].head()

   Rank  ...                                              Notes
0   1.0  ...              17,098,242 including European part[1]
1   2.0  ...  excludes Hong Kong, Macau, Taiwan and disputed...
2   3.0  ...             including Jammu and Kashmir and Ladakh
3   4.0  ...                                                NaN
4   5.0  ...                                                NaN

[5 rows x 4 columns]

In [0]:

# extract several tables from wikipedia from a single page
from pandas.io.html import read_html
page = 'https://en.wikipedia.org/wiki/List_of_UFC_events'

wikitables = read_html(page, index_col=0, attrs={"id":"Scheduled_events"})

print ("Extracted {num} wikitables".format(num=len(wikitables)))

Extracted 1 wikitables

In [0]:
wikitables[0].head()

                                              Date  ...  Ref.
Event                                               ...
UFC 250                                May 9, 2020  ...   [9]
UFC Fight Night 173                   Apr 25, 2020  ...  [10]
UFC 249: Khabib vs. Ferguson          Apr 18, 2020  ...  [11]
UFC Fight Night 172                   Apr 11, 2020  ...  [12]
UFC on ESPN: Ngannou vs. Rozenstruik  Mar 28, 2020  ...  [13]

[5 rows x 4 columns]

# Using Beautiful Soup

In [0]:

import requests
website_url = requests.get('https://www.hec.gov.pk/english/universities/Pages/AJK/rank.aspx').text

In [0]:
from bs4 import BeautifulSoup
soup = BeautifulSoup(website_url,'lxml')

In [0]:
My_table = soup.find('table',{'id':'ctl00_ctl42_g_5291d0cc_f923_4be8_a6e8_928ccc10497b_csr1_table'})

In [0]:
links = My_table.findAll('<a')

AttributeError: ignored

In [0]:
events = []
for link in links:
    events.append(link.get('title'))

In [0]:
import pandas as pd
df = pd.DataFrame()
df['events'] = events

df.head()

                  events
0                UFC 250
1  Ginásio do Ibirapuera
2              São Paulo
3                   None
4    UFC Fight Night 173

#Interacting with Databases

In [0]:
#conda install -c anaconda sqlite 
import sqlite3

# creating table
query = """CREATE TABLE test (a VARCHAR(20),
         b VARCHAR(20), c REAL,
         d INTEGER);"""
# creating a database file
con = sqlite3.connect('mydata.sqlite')    
# running query
con.execute(query)
# table created
con.commit()

### Insering data

In [0]:

# inserting data
#preparing data
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)
       ]
# preparing insert statement
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"
# running insert statement
con.executemany(stmt, data)
#finalizing data saving
con.commit()

In [4]:
#selecting/extracting data
cursor = con.execute('select * from test')
rows = cursor.fetchall()
print(type(rows), rows)
rows

<class 'list'> [('Atlanta', 'Georgia', 1.25, 6), ('Tallahassee', 'Florida', 2.6, 3), ('Sacramento', 'California', 1.7, 5)]

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

# Testing

In [9]:
# p = pd.DataFrame(rows)
# p
p = pd.DataFrame(rows, columns=['col 1','col 2','col 3','col 4'])
p

         col 1       col 2  col 3  col 4
0      Atlanta     Georgia   1.25      6
1  Tallahassee     Florida   2.60      3
2   Sacramento  California   1.70      5

In [0]:

p.to_csv("/content/sample_data/out.csv")

In [0]:
col = pd.DataFrame(rows, )

In [0]:
#print(cursor.description)
data_df = pd.DataFrame(rows, columns=[x[0] for x in cursor.description])
data_df

             a           b     c  d
0        Sindh     Karachi  2.25  8
1       Punjab      Lahore  1.50  2
2          KPK    Peshawar  6.50  3
3  Balochistan      Quetta  2.50  3
4      Atlanta     Georgia  1.25  6
5  Tallahassee     Florida  2.60  3
6   Sacramento  California  1.70  5

In [0]:
#conda install -c anaconda sqlalchemy 
# using sqlalchemy 
import sqlalchemy as sqla
db = sqla.create_engine('sqlite:///mydata.sqlite')
data_df =pd.read_sql('select * from test', db)
data_df

             a           b     c  d
0        Sindh     Karachi  2.25  8
1       Punjab      Lahore  1.50  2
2          KPK    Peshawar  6.50  3
3  Balochistan      Quetta  2.50  3
4      Atlanta     Georgia  1.25  6
5  Tallahassee     Florida  2.60  3
6   Sacramento  California  1.70  5

#end of six chapter